Revit 2024 API
VertexFormat Members
The VertexFormat type exposes the following members.
Constructors
Name | Description
VertexFormat
 Constructs the specification of vertex format from a numerical representation.
Methods
Name | Description
Dispose
Releases all resources used by the VertexFormat
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Tests whether the vertex format specification is valid for rendering.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace